app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
---
	      <%= link_to post.title, "#{post.url}" %>
	      <%= link_to "#{pluralize(post.comments.count, "comment")}", post_path(post) %>