app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
      <br />
      <%= link_to "#{pluralize(post.comments.count, "comment")}", post_path(post) %>