app/views/posts/show.html.erb

  <%= link_to @post.title, "#{@post.url}" %><br />
  <%= link_to "#{pluralize(@post.comments.count, "comment")}", post_path(@post) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]