app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 20 Aug 2013 23:32:53 UTC +00:00], ["name", "LOLOL"], ["updated_at", Tue, 20 Aug 2013 23:32:53 UTC +00:00]]
---
  def create
    @category = Category.new(params_category)

    if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = 2  [["name", "PHP rhymes with Wee8chWee"], ["updated_at", Tue, 20 Aug 2013 23:36:42 UTC +00:00]]
---
  def update
    if @category.update_attributes(params_category)