app/controllers/comments_controller.rb

  def create
    @post    = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @comment.post = @post

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "I made a comment"], ["created_at", Sat, 24 Aug 2013 23:24:10 UTC +00:00], ["post_id", 5], ["updated_at", Sat, 24 Aug 2013 23:24:10 UTC +00:00], ["user_id", 1]]