app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Sat, 17 Aug 2013 19:47:55 UTC +00:00], ["title", "Bipolar II"], ["updated_at", Sat, 17 Aug 2013 19:47:55 UTC +00:00], ["url", "http://en.wikipedia.org/wiki/Bipolar_II_disorder"]]
---
  def create
    @post = Post.new(params_post)
    @post.user = current_user

    if @post.save

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by { |i| i.score }.reverse

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @categories = Category.all

UPDATE "posts" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "posts"."id" = 10  [["title", "lolol"], ["url", "http://mememem.com"], ["updated_at", Sat, 17 Aug 2013 23:19:39 UTC +00:00]]
---
  def update
    if @post.update_attributes(params_post)