app/controllers/users_controller.rb

  def create
    @user = User.new(params_user)

    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)