app/controllers/votes_controller.rb

DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 11]]
UPDATE "votes" SET "value" = ?, "updated_at" = ? WHERE "votes"."id" = 24  [["value", 1], ["updated_at", Tue, 27 Aug 2013 05:19:03 UTC +00:00]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "value", "votable_id", "votable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 27 Aug 2013 01:03:07 UTC +00:00], ["updated_at", Tue, 27 Aug 2013 01:03:07 UTC +00:00], ["user_id", 1], ["value", 1], ["votable_id", 1], ["votable_type", "Post"]]
---
  def create
    @vote = find_or_initialize_vote

		case
    when identical? then @vote.destroy
    when opposite?  then @vote.update_attributes(value: params[:value])
    else
      @vote.value = params[:value]
      @vote.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = '1' AND "votes"."user_id" = 1 LIMIT 1
---
	def find_or_initialize_vote
		if params.has_key? :post_id
      post = Post.find(params[:post_id])
			Vote.find_or_initialize_by(votable: post, user_id: current_user.id)